**`teams/delius-iaps/iaps_server`** terragrunt plan on `push` event [#58](${url})

```
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Reading...
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Reading...
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Reading...
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Read complete after 1s
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Read complete after 1s
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Reading...
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_imagebuilder_component.this["amazon-cloudwatch-agent-windows"]: Reading...
module.imagebuilder.data.aws_imagebuilder_component.this["ec2launch-v2-windows"]: Reading...
module.imagebuilder.data.aws_caller_identity.current: Reading...
module.imagebuilder.data.aws_caller_identity.current: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Reading...
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_imagebuilder_component.this["amazon-cloudwatch-agent-windows"]: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.data.aws_imagebuilder_component.this["ec2launch-v2-windows"]: Read complete after 2s [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_configure_odbcdns.yml"]: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_base_packages.yml"]: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_component.this["add_net_framework_features.yml"]: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_oracle_db_client_tools.yml"]: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_distribution_configuration.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_oracle_sql_developer.yml"]: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_im_interface.yml"]: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_image_recipe.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_image_pipeline.this: Refreshing state... [id=<REDACTED>]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_im_interface.yml"] has changed
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-install-im-interface/0.1.0/1"
        name                  = "delius_iaps_install_im_interface"
      + supported_os_versions = []
        tags                  = {
            "add_net_framework_features-version"                 = "0.2.0"
            "amazon-cloudwatch-agent-windows-version"            = "1.0.0"
            "application"                                        = "DELIUS-IAPS"
            "branch"                                             = "main"
            "business-unit"                                      = "HMPPS"
            "delius_iaps_configure_odbc_dsn-version"             = "0.1.0"
            "delius_iaps_install_base_packages-version"          = "0.1.0"
            "delius_iaps_install_im_interface-version"           = "0.1.0"
            "delius_iaps_install_oracle_db_client_tools-version" = "0.1.0"
            "delius_iaps_install_oracle_sql_developer-version"   = "0.1.0"
            "ec2launch-v2-windows-version"                       = "1.0.0"
            "image-pipeline"                                     = "delius_iaps_server"
            "image-recipe"                                       = "delius_iaps_server/0.0.9"
            "infrastructure-configuration"                       = "delius_iaps_server/0.0.9"
            "is-production"                                      = "true"
            "os-version"                                         = "windows server 2022"
            "owner"                                              = "Probation Webops: probation-webops@digital.justice.gov.uk"
            "release-or-patch"                                   = "patch"
            "source-code"                                        = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/delius-iaps"
        }
        # (12 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.imagebuilder.aws_imagebuilder_component.this["add_net_framework_features.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/add-net-framework-features/0.2.0/1"
        name                  = "add_net_framework_features"
      ~ tags                  = {
          ~ "delius_iaps_install_base_packages-version"          = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.9" -> "delius_iaps_server/0.0.10"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.9" -> "delius_iaps_server/0.0.10"
            # (16 unchanged elements hidden)
        }
      ~ tags_all              = {
          ~ "delius_iaps_install_base_packages-version"          = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.9" -> "delius_iaps_server/0.0.10"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.9" -> "delius_iaps_server/0.0.10"
            # (16 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_configure_odbcdns.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-configure-odbc-dsn/0.1.0/1"
        name                  = "delius_iaps_configure_odbc_dsn"
      ~ tags                  = {
          ~ "delius_iaps_install_base_packages-version"          = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.9" -> "delius_iaps_server/0.0.10"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.9" -> "delius_iaps_server/0.0.10"
            # (16 unchanged elements hidden)
        }
      ~ tags_all              = {
          ~ "delius_iaps_install_base_packages-version"          = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.9" -> "delius_iaps_server/0.0.10"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.9" -> "delius_iaps_server/0.0.10"
            # (16 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_base_packages.yml"] must be replaced
+/- resource "aws_imagebuilder_component" "this" {
      ~ arn                   = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-install-base-packages/0.1.0/1" -> (known after apply)
      ~ data                  = <<-EOT # forces replacement
            ---
            name: delius_iaps_install_base_packages
            description: Install base package managers and packages
            schemaVersion: 1.0
            parameters:
              - Version:
                  type: string
          -       default: 0.1.0
          +       default: 0.1.1
                  description: Component version
              - Platform:
                  type: string
                  default: "Windows"
                  description: Platform name
            phases:
              - name: build
                steps:
                  - name: DeliusIapsInstallBasePackages
                    action: ExecutePowerShell
                    inputs:
                      commands:
                        - |
                          $ErrorActionPreference = "Stop"
                          $VerbosePreference = "Continue"
            
                          Set-ExecutionPolicy Bypass -Scope Process -Force; [System.Net.ServicePointManager]::SecurityProtocol = [System.Net.ServicePointManager]::SecurityProtocol -bor 3072; iex ((New-Object System.Net.WebClient).DownloadString('https://community.chocolatey.org/install.ps1'))
            
                          Write-Host('vcredist packages')
                          # choco install -y vcredist2010 # Commented out - hoping we don't need to explicitly mention this due to dynamic package dependency
                          # choco install -y vcredist2008 # Commented out - hoping we don't need to explicitly mention this due to dynamic package dependency
            
                          Write-Host('nginx proxy')
                          choco install -y nginx  # --params "/installLocation:C:\nginx /port:80"
            
                          Write-Host('Firefox browser')
                          choco install -y firefox # install latest version
            
                          Write-Host('7Zip archive util')
                          choco install -y 7zip # install latest version
            
          -               Write-Host('Install openssl for converting between pkcs12 and pem')
          -               # Installs vcredist140 (Visual C++ 2017) as a dependency
          -               # choco install -y openssl.light --version 1.1.1.20181020 # Hoping we don't need this
          - 
                          Write-Host('Install SoapUI for test and debugging')
                          choco install -y soapui
        EOT
      ~ date_created          = "2023-01-04T16:00:35.252Z" -> (known after apply)
      ~ encrypted             = true -> (known after apply)
      ~ id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-install-base-packages/0.1.0/1" -> (known after apply)
        name                  = "delius_iaps_install_base_packages"
      ~ owner                 = "374269020027" -> (known after apply)
      - supported_os_versions = [] -> null
      ~ tags                  = {
          ~ "delius_iaps_install_base_packages-version"          = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.9" -> "delius_iaps_server/0.0.10"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.9" -> "delius_iaps_server/0.0.10"
            # (16 unchanged elements hidden)
        }
      ~ tags_all              = {
          ~ "delius_iaps_install_base_packages-version"          = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.9" -> "delius_iaps_server/0.0.10"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.9" -> "delius_iaps_server/0.0.10"
            # (16 unchanged elements hidden)
        }
      ~ type                  = "BUILD" -> (known after apply)
      ~ version               = "0.1.0" -> "0.1.1" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_im_interface.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-install-im-interface/0.1.0/1"
        name                  = "delius_iaps_install_im_interface"
      ~ tags                  = {
          ~ "delius_iaps_install_base_packages-version"          = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.9" -> "delius_iaps_server/0.0.10"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.9" -> "delius_iaps_server/0.0.10"
            # (16 unchanged elements hidden)
        }
      ~ tags_all              = {
          ~ "delius_iaps_install_base_packages-version"          = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.9" -> "delius_iaps_server/0.0.10"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.9" -> "delius_iaps_server/0.0.10"
            # (16 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_oracle_db_client_tools.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-install-oracle-db-client-tools/0.1.0/1"
        name                  = "delius_iaps_install_oracle_db_client_tools"
      ~ tags                  = {
          ~ "delius_iaps_install_base_packages-version"          = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.9" -> "delius_iaps_server/0.0.10"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.9" -> "delius_iaps_server/0.0.10"
            # (16 unchanged elements hidden)
        }
      ~ tags_all              = {
          ~ "delius_iaps_install_base_packages-version"          = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.9" -> "delius_iaps_server/0.0.10"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.9" -> "delius_iaps_server/0.0.10"
            # (16 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_oracle_sql_developer.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-install-oracle-sql-developer/0.1.0/1"
        name                  = "delius_iaps_install_oracle_sql_developer"
      ~ tags                  = {
          ~ "delius_iaps_install_base_packages-version"          = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.9" -> "delius_iaps_server/0.0.10"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.9" -> "delius_iaps_server/0.0.10"
            # (16 unchanged elements hidden)
        }
      ~ tags_all              = {
          ~ "delius_iaps_install_base_packages-version"          = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.9" -> "delius_iaps_server/0.0.10"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.9" -> "delius_iaps_server/0.0.10"
            # (16 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_distribution_configuration.this will be updated in-place
  ~ resource "aws_imagebuilder_distribution_configuration" "this" {
        id           = "arn:aws:imagebuilder:eu-west-2:374269020027:distribution-configuration/delius-iaps-server"
        name         = "delius_iaps_server"
      ~ tags         = {
          ~ "delius_iaps_install_base_packages-version"          = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.9" -> "delius_iaps_server/0.0.10"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.9" -> "delius_iaps_server/0.0.10"
            # (16 unchanged elements hidden)
        }
      ~ tags_all     = {
          ~ "delius_iaps_install_base_packages-version"          = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.9" -> "delius_iaps_server/0.0.10"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.9" -> "delius_iaps_server/0.0.10"
            # (16 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

      ~ distribution {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.imagebuilder.aws_imagebuilder_image_pipeline.this must be replaced
-/+ resource "aws_imagebuilder_image_pipeline" "this" {
      ~ arn                              = "arn:aws:imagebuilder:eu-west-2:374269020027:image-pipeline/delius-iaps-server" -> (known after apply)
      ~ date_created                     = "2023-01-20T13:38:17.606Z" -> (known after apply)
      ~ date_last_run                    = "2023-01-20T16:35:08.185Z" -> (known after apply)
      ~ date_next_run                    = "2023-02-02T00:00:00.000Z" -> (known after apply)
      ~ date_updated                     = "2023-01-20T13:38:17.606Z" -> (known after apply)
      ~ id                               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-pipeline/delius-iaps-server" -> (known after apply)
      ~ image_recipe_arn                 = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/delius-iaps-server/0.0.9" -> (known after apply) # forces replacement
      ~ infrastructure_configuration_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/delius-iaps-server-0-0-9" -> (known after apply)
        name                             = "delius_iaps_server"
      ~ platform                         = "Windows" -> (known after apply)
      ~ tags                             = {
          ~ "delius_iaps_install_base_packages-version"          = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.9" -> "delius_iaps_server/0.0.10"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.9" -> "delius_iaps_server/0.0.10"
            # (16 unchanged elements hidden)
        }
      ~ tags_all                         = {
          ~ "delius_iaps_install_base_packages-version"          = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.9" -> "delius_iaps_server/0.0.10"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.9" -> "delius_iaps_server/0.0.10"
            # (16 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

      ~ schedule {
          + timezone                           = (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.imagebuilder.aws_imagebuilder_image_recipe.this must be replaced
+/- resource "aws_imagebuilder_image_recipe" "this" {
      ~ arn               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/delius-iaps-server/0.0.9" -> (known after apply)
      ~ date_created      = "2023-01-20T13:38:15.413Z" -> (known after apply)
      ~ id                = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/delius-iaps-server/0.0.9" -> (known after apply)
        name              = "delius_iaps_server"
      ~ owner             = "374269020027" -> (known after apply)
      ~ platform          = "Windows" -> (known after apply)
      ~ tags              = {
          ~ "delius_iaps_install_base_packages-version"          = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.9" -> "delius_iaps_server/0.0.10"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.9" -> "delius_iaps_server/0.0.10"
            # (16 unchanged elements hidden)
        }
      ~ tags_all          = {
          ~ "delius_iaps_install_base_packages-version"          = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.9" -> "delius_iaps_server/0.0.10"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.9" -> "delius_iaps_server/0.0.10"
            # (16 unchanged elements hidden)
        }
      + user_data_base64  = (known after apply)
      ~ version           = "0.0.9" -> "0.0.10" # forces replacement
      - working_directory = "" -> null
        # (2 unchanged attributes hidden)

      - block_device_mapping {
          - device_name = "/dev/sda1" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 30 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sda1"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 30
              + volume_type           = "gp3"
            }
        }
      - block_device_mapping {
          - device_name = "/dev/xvdf" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - snapshot_id           = "snap-04435aa8246764616" -> null
              - throughput            = 0 -> null
              - volume_size           = 7 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/xvdf"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + snapshot_id           = "snap-04435aa8246764616"
              + volume_size           = 7
              + volume_type           = "gp3"
            }
        }

      ~ component {
          ~ component_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-install-base-packages/0.1.0/1" -> (known after apply) # forces replacement
        }

      + systems_manager_agent {
          + uninstall_after_build = (known after apply)
        }

        # (7 unchanged blocks hidden)
    }

  # module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this must be replaced
-/+ resource "aws_imagebuilder_infrastructure_configuration" "this" {
      ~ arn                           = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/delius-iaps-server-0-0-9" -> (known after apply)
      ~ date_created                  = "2023-01-20T13:38:09.696Z" -> (known after apply)
      + date_updated                  = (known after apply)
      ~ id                            = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/delius-iaps-server-0-0-9" -> (known after apply)
      ~ name                          = "delius_iaps_server_0_0_9" -> "delius_iaps_server_0_0_10" # forces replacement
      ~ resource_tags                 = {
          ~ "delius_iaps_install_base_packages-version"          = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.9" -> "delius_iaps_server/0.0.10"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.9" -> "delius_iaps_server/0.0.10"
            # (16 unchanged elements hidden)
        }
      ~ tags                          = {
          ~ "delius_iaps_install_base_packages-version"          = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.9" -> "delius_iaps_server/0.0.10"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.9" -> "delius_iaps_server/0.0.10"
            # (16 unchanged elements hidden)
        }
      ~ tags_all                      = {
          ~ "delius_iaps_install_base_packages-version"          = "0.1.0" -> "0.1.1"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.9" -> "delius_iaps_server/0.0.10"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.9" -> "delius_iaps_server/0.0.10"
            # (16 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 4 to add, 6 to change, 4 to destroy.

```
